app/controllers/call_controller.rb

  def index
    @me = current_user
    @friends = User.all.select{ |u| u != @me }
---
SELECT "users".* FROM "users"